{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim"
    },
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "autolist.nvim": {
      "src": "https://github.com/gaoDean/autolist.nvim"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-calc": {
      "src": "https://github.com/hrsh7th/cmp-calc"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline"
    },
    "cmp-emoji": {
      "src": "https://github.com/hrsh7th/cmp-emoji"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-nvim-lua": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lua"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip"
    },
    "dial.nvim": {
      "src": "https://github.com/monaqa/dial.nvim"
    },
    "diffview.nvim": {
      "src": "https://github.com/sindrets/diffview.nvim"
    },
    "eyeliner.nvim": {
      "src": "https://github.com/jinh0/eyeliner.nvim"
    },
    "flatten.nvim": {
      "src": "https://github.com/willothy/flatten.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "glow.nvim": {
      "src": "https://github.com/ellisonleao/glow.nvim"
    },
    "gruvbox.nvim": {
      "src": "https://github.com/ellisonleao/gruvbox.nvim"
    },
    "iron.nvim": {
      "src": "https://github.com/Vigemus/iron.nvim"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "markdown-preview.nvim": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "marks.nvim": {
      "src": "https://github.com/chentoast/marks.nvim"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/williamboman/mason-lspconfig.nvim"
    },
    "mason-nvim-dap.nvim": {
      "src": "https://github.com/jay-babu/mason-nvim-dap.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/williamboman/mason.nvim"
    },
    "mini.ai": {
      "src": "https://github.com/echasnovski/mini.ai"
    },
    "mini.sessions": {
      "src": "https://github.com/echasnovski/mini.sessions"
    },
    "neo-tree.nvim": {
      "src": "https://github.com/nvim-neo-tree/neo-tree.nvim",
      "version": "'v3.x'"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "nvim-FeMaco.lua": {
      "src": "https://github.com/AckslD/nvim-FeMaco.lua"
    },
    "nvim-aider": {
      "src": "https://github.com/GeorgesAlkhouri/nvim-aider"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-colorizer.lua": {
      "src": "https://github.com/catgoose/nvim-colorizer.lua"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-go": {
      "src": "https://github.com/leoluz/nvim-dap-go"
    },
    "nvim-dap-python": {
      "src": "https://github.com/mfussenegger/nvim-dap-python"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-hlslens": {
      "src": "https://github.com/kevinhwang91/nvim-hlslens"
    },
    "nvim-lightbulb": {
      "src": "https://github.com/kosayoda/nvim-lightbulb"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-navic": {
      "src": "https://github.com/SmiteshP/nvim-navic"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-spider": {
      "src": "https://github.com/chrisgrieser/nvim-spider"
    },
    "nvim-surround": {
      "src": "https://github.com/kylechui/nvim-surround"
    },
    "nvim-toc": {
      "src": "https://github.com/richardbizik/nvim-toc"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'master'"
    },
    "nvim-treesitter-endwise": {
      "src": "https://github.com/RRethy/nvim-treesitter-endwise"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'master'"
    },
    "nvim-ts-context-commentstring": {
      "src": "https://github.com/JoosepAlviste/nvim-ts-context-commentstring"
    },
    "nvim-ufo": {
      "src": "https://github.com/kevinhwang91/nvim-ufo"
    },
    "nvim-various-textobjs": {
      "src": "https://github.com/chrisgrieser/nvim-various-textobjs"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "nvim_context_vt": {
      "src": "https://github.com/haringsrob/nvim_context_vt"
    },
    "obsidian.nvim": {
      "src": "https://github.com/epwalsh/obsidian.nvim"
    },
    "octo.nvim": {
      "src": "https://github.com/pwntester/octo.nvim"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "otter.nvim": {
      "src": "https://github.com/jmbuhr/otter.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "project.nvim": {
      "src": "https://github.com/ahmedkhalf/project.nvim"
    },
    "promise-async": {
      "src": "https://github.com/kevinhwang91/promise-async"
    },
    "rainbow-delimiters.nvim": {
      "src": "https://github.com/HiPhish/rainbow-delimiters.nvim"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "sentiment.nvim": {
      "src": "https://github.com/utilyre/sentiment.nvim"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "sqlite.lua": {
      "src": "https://github.com/kkharji/sqlite.lua"
    },
    "text-case.nvim": {
      "src": "https://github.com/johmsalas/text-case.nvim"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "treesj": {
      "src": "https://github.com/Wansmer/treesj"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-illuminate": {
      "src": "https://github.com/RRethy/vim-illuminate"
    },
    "vim-table-mode": {
      "src": "https://github.com/dhruvasagar/vim-table-mode"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "yanky.nvim": {
      "src": "https://github.com/gbprod/yanky.nvim"
    }
  }
}
